Practicas/PracticasGretl/Prct-Lecc03.org
#+title:  Lección 3
#+author: Marcos Bujosa
#+STARTUP: show4levels
#+LANGUAGE: es-es

#+EXPORT_FILE_NAME: pub/Prct-Lecc03

# +OPTIONS: toc:nil
#+OPTIONS: tags:nil

#+LATEX_CLASS: article
#+LATEX_HEADER: \usepackage[spanish]{babel}
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+LaTeX_HEADER: \usepackage[svgnames,x11names]{xcolor}
#+LaTeX_HEADER: \hypersetup{linktoc = all, colorlinks = true, urlcolor = DodgerBlue4, citecolor = PaleGreen1, linkcolor = SpringGreen4}
#+LaTeX_HEADER: \PassOptionsToPackage{hyphens}{url}
# +LaTeX_HEADER: \input{notacionLinAlg.tex}
#+LaTeX_HEADER: \usepackage{nacal}

#+LaTeX_HEADER: \usepackage{framed}

#+LaTeX_HEADER: \usepackage{listings}
#+LaTeX_HEADER: \input{hansl.tex}
#+LaTeX_HEADER: \lstnewenvironment{hansl-gretl}
#+LaTeX_HEADER: {\lstset{language={hansl},basicstyle={\ttfamily\footnotesize},numbers,rame=single,breaklines=true}}
#+LaTeX_HEADER: {}
#+LaTeX_HEADER: \newcommand{\hansl}[1]{\lstset{language={hansl},basicstyle={\ttfamily\small}}\lstinline{#1}}
# +LaTeX_HEADER: \lstset{backgroundcolor=\color{white},basicstyle=\ttfamily\footnotesize,breaklines=true, captionpos=b,commentstyle=\color{mygreen},escapeinside={\%*}{*)}, keywordstyle=\color{blue},stringstyle=\color{mymauve}, }
# +LaTeX_HEADER: \lstset{backgroundcolor=\color{lightgray!20},basicstyle=\ttfamily\footnotesize,breaklines=true, }
#+LaTeX_HEADER: \lstset{backgroundcolor=\color{lightgray!20}, }

#+name: setup-listings
#+begin_src emacs-lisp :exports none :results silent
  (setq org-latex-listings 'listings)
  (setq org-latex-custom-lang-environments
  	;'((emacs-lisp "common-lispcode")))
  	'((emacs-lisp "hansl-gretl")))
  (setq org-latex-listings-options
	'(("frame" "lines")
	  ("basicstyle" "\\scriptsize")
	  ("basicstyle" "\\ttfamily")
	  ("numbers=none" "left")
	  ("backgroundcolor=\\color{lightgray!20}")
	  ("numberstyle" "\\tiny")))
  (setq org-latex-to-pdf-process
	'("pdflatex -interaction nonstopmode -output-directory %o %f"
	"pdflatex -interaction nonstopmode -output-directory %o %f"
	"pdflatex -interaction nonstopmode -output-directory %o %f"))
  (org-add-link-type
   "latex" nil
   (lambda (path desc format)
     (cond
      ((eq format 'html)
       (format "<span class=\"%s\">%s</span>" path desc))
      ((eq format 'latex)
       (format "\\%s{%s}" path desc)))))
#+end_src

# \lstnewenvironment{code}
#     {\lstset{language=haskell,
#     basicstyle=\small\ttfamily,
#     numbers=left,
#     numberstyle=\tiny\color{gray},
#     backgroundcolor=\color{lightgray},
#     firstnumber=auto
#     }}
#     {}

#+bibliography: ref.bib

# +latex: \clearpage


* Correlación espuria entre la incidencia de melanoma en el estado de Connecticut y el PNB de EEUU
   :PROPERTIES:
   :header-args: :tangle ./pub/scripts/GNPvsMelanoma.inp
   :END:

   | Guión: | [[https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/GNPvsMelanoma.inp][GNPvsMelanoma.inp]] |
   
***** Objetivo
Comprobar cómo la aparente relación entre ambas series temporales se
desvanece al tomar primeras diferencias

***** Carga de datos
*/~Archivo --> Abrir datos --> Archivo de usuario~/* y buscar en el
disco el fichero =GNPvsMelanoma.gdt=.

#+latex: {\vspace{0pt} \footnotesize \color{gray!70!black}
/o bien teclee en linea de comandos/:
#+NAME: Lectura del fichero de datos
#+begin_src hansl 
open datos/GNPvsMelanoma.gdt
#+end_src
#+latex: }

** Actividad 1 - Dibujar ambas series en un mismo gráfico
Marque las series =GNP= y =Melanoma=. Pulse sobre ellas con el botón
derecho del ratón. En el menú desplegable seleccione */~Gráfico de
Series Temporales~/* (indique representar en un único gráfico).

Guarde el gráfico en la sesión como un icono.

#+latex: {\vspace{1pt} \footnotesize \color{gray!70!black}
/o bien teclee en linea de comandos/:
      #+begin_src hansl
      GraficoSeriesEnNiveles <- gnuplot GNP Melanoma --time-series --with-lines
      #+end_src
      #+latex: }
 
#+latex: \vspace{-3pt}   

** Actividad 2 - Dibujar el diagrama de dispersión
Marque las series =GNP= y =Melanoma=. Pulse sobre ellas con el botón
derecho del ratón. En el menú desplegable seleccione */~Gráfico de
dispersión XY~/* (elija como variable del eje X =Melanoma= y marque
suprimir la recta estimada).

Guarde el gráfico en la sesión como un icono.

#+latex: {\vspace{1pt} \footnotesize \color{gray!70!black}
/o bien teclee en linea de comandos/:
      #+begin_src hansl
      DiagramDispersion <- gnuplot GNP Melanoma --fit=none
      #+end_src
      #+latex: }
      
#+latex: \vspace{-3pt}   

1) ¿Tienen tendencia estas series temporales?
2) ¿Parece ser una tendencia común a ambas series?
3) Pero... ¿lo podemos saber con seguridad solo mirando el gráfico?

** Actividad 3 - Calcular la correlación entre ambas series
Marque las series =GNP= y =Melanoma=. Pulse sobre ellas con el botón
derecho del ratón. En el menú desplegable seleccione */~Matriz de
correlación~/*

#+latex: {\vspace{0pt} \footnotesize \color{gray!70!black}
/o bien teclee en linea de comandos/:
#+begin_src hansl 
corr GNP Melanoma
#+end_src
#+latex: }

