docs/Practicas/PracticasGretl/Prct-Lecc03.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es-es" xml:lang="es-es">
<head>
<!-- 2024-10-15 mar 15:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lección 3</title>
<meta name="author" content="Marcos Bujosa" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Lección 3</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org18b8705">1. Correlación espuria entre la incidencia de melanoma en el estado de Connecticut y el PNB de EEUU</a>
<ul>
<li><a href="#org425e21f">1.1. Actividad 1 - Dibujar ambas series en un mismo gráfico</a></li>
<li><a href="#org269dcfa">1.2. Actividad 2 - Dibujar el diagrama de dispersión</a></li>
<li><a href="#orgafc80fd">1.3. Actividad 3 - Calcular la correlación entre ambas series</a></li>
<li><a href="#org66cbcb4">1.4. Actividad 4 - Regresar <code>GNP</code> sobre <code>Melanoma</code> y constatar que el ajuste es bueno</a></li>
<li><a href="#orgd32674e">1.5. Actividad 5 - Añadir la primera diferencia de los datos</a></li>
<li><a href="#org4252351">1.6. Actividad 6 - Regresar <code>d_GNP</code> sobre <code>d_Melanoma</code> y constatar que el ajuste es horrible</a></li>
</ul>
</li>
<li><a href="#org451b297">2. Tipos de interés a corto y largo plazo</a>
<ul>
<li><a href="#org505a8ec">2.1. Actividad 1 - Dibujar ambas series en un mismo gráfico</a></li>
<li><a href="#orgee68133">2.2. Actividad 2 - Dibujar el diagrama de dispersión y calcule la correlación</a></li>
<li><a href="#org7094c83">2.3. Actividad 3 - Regrese la primera diferencia de los tipos a corto sobre la diferencia de los tipos a largo</a></li>
<li><a href="#org6e579d6">2.4. Actividad 4 - Ajuste los tipos corto plazo en función de los tipos a largo</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org18b8705" class="outline-2">
<h2 id="org18b8705"><span class="section-number-2">1.</span> Correlación espuria entre la incidencia de melanoma en el estado de Connecticut y el PNB de EEUU</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Guión:</td>
<td class="org-left"><a href="https://github.com/mbujosab/EconometriaAplicada-SRC/blob/main/Practicas/PracticasGretl/pub/scripts/GNPvsMelanoma.inp">GNPvsMelanoma.inp</a></td>
</tr>
</tbody>
</table>
</div>
<ol class="org-ol">
<li><a id="org19380fa"></a>Objetivo<br />
<div class="outline-text-6" id="text-1-0-0-0-1">
<p>
Comprobar cómo la aparente relación entre ambas series temporales se
desvanece al tomar primeras diferencias
</p>
</div>
</li>
<li><a id="org8db95c6"></a>Carga de datos<br />
<div class="outline-text-6" id="text-1-0-0-0-2">
<p>
<b><i><code>Archivo --&gt; Abrir datos --&gt; Archivo de usuario</code></i></b> y buscar en el
disco el fichero <code>GNPvsMelanoma.gdt</code>.
</p>

<p>
<i>o bien teclee en linea de comandos</i>:
</p>
<div class="org-src-container">
<pre class="src src-hansl" id="orgb7eea44">open datos/GNPvsMelanoma.gdt
</pre>
</div>
</div>
</li>
</ol>
<div id="outline-container-org425e21f" class="outline-3">
<h3 id="org425e21f"><span class="section-number-3">1.1.</span> Actividad 1 - Dibujar ambas series en un mismo gráfico</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Marque las series <code>GNP</code> y <code>Melanoma</code>. Pulse sobre ellas con el botón
derecho del ratón. En el menú desplegable seleccione <b><i><code>Gráfico de
Series Temporales</code></i></b> (indique representar en un único gráfico).
</p>

<p>
Guarde el gráfico en la sesión como un icono.
</p>

<p>
<i>o bien teclee en linea de comandos</i>:
</p>
<div class="org-src-container">
<pre class="src src-hansl">      GraficoSeriesEnNiveles &lt;- gnuplot GNP Melanoma --time-series --with-lines
</pre>
</div>
</div>
</div>
<div id="outline-container-org269dcfa" class="outline-3">
<h3 id="org269dcfa"><span class="section-number-3">1.2.</span> Actividad 2 - Dibujar el diagrama de dispersión</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Marque las series <code>GNP</code> y <code>Melanoma</code>. Pulse sobre ellas con el botón
derecho del ratón. En el menú desplegable seleccione <b><i><code>Gráfico de
dispersión XY</code></i></b> (elija como variable del eje X <code>Melanoma</code> y marque
suprimir la recta estimada).
</p>

<p>
Guarde el gráfico en la sesión como un icono.
</p>

<p>
<i>o bien teclee en linea de comandos</i>:
</p>
<div class="org-src-container">
<pre class="src src-hansl">      DiagramDispersion &lt;- gnuplot GNP Melanoma --fit=none
</pre>
</div>
<ol class="org-ol">
<li>¿Tienen tendencia estas series temporales?</li>
<li>¿Parece ser una tendencia común a ambas series?</li>
<li>Pero&#x2026; ¿lo podemos saber con seguridad solo mirando el gráfico?</li>
</ol>
</div>
</div>
<div id="outline-container-orgafc80fd" class="outline-3">
<h3 id="orgafc80fd"><span class="section-number-3">1.3.</span> Actividad 3 - Calcular la correlación entre ambas series</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Marque las series <code>GNP</code> y <code>Melanoma</code>. Pulse sobre ellas con el botón
derecho del ratón. En el menú desplegable seleccione <b><i><code>Matriz de
correlación</code></i></b>
</p>

<p>
<i>o bien teclee en linea de comandos</i>:
</p>
<div class="org-src-container">
<pre class="src src-hansl">corr GNP Melanoma
</pre>
</div>
</div>
</div>
