Practicas/PracticasGretl/pub/Prct-Lecc03.tex
% Created 2024-07-26 vie 15:58
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[spanish, ]{babel}
\usepackage[margin=0.5in]{geometry}
\usepackage[svgnames,x11names]{xcolor}
\hypersetup{linktoc = all, colorlinks = true, urlcolor = DodgerBlue4, citecolor = PaleGreen1, linkcolor = SpringGreen4}
\PassOptionsToPackage{hyphens}{url}
\usepackage{nacal}
\usepackage{framed}
\usepackage{listings}
\input{hansl.tex}
\lstnewenvironment{hansl-gretl}
{\lstset{language={hansl},basicstyle={\ttfamily\footnotesize},numbers,rame=single,breaklines=true}}
{}
\newcommand{\hansl}[1]{\lstset{language={hansl},basicstyle={\ttfamily\small}}\lstinline{#1}}
\lstset{backgroundcolor=\color{lightgray!20}, }
\author{Marcos Bujosa}
\date{\today}
\title{Lección 3}
\begin{document}

\maketitle
\tableofcontents



\section{Correlación espuria entre la incidencia de melanoma en el estado de Connecticut y el PNB de EEUU}
\label{sec:org862f110}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/GNPvsMelanoma.inp}{GNPvsMelanoma.inp}\\[0pt]
\end{tabular}
\end{center}

\begin{enumerate}
\item Objetivo
\label{sec:orge63afff}
Comprobar cómo la aparente relación entre ambas series temporales se
desvanece al tomar primeras diferencias

\item Carga de datos
\label{sec:org7bcc780}
\textbf{\emph{\texttt{Archivo -{}-{}> Abrir datos -{}-{}> Archivo de usuario}}} y buscar en el
disco el fichero \texttt{GNPvsMelanoma.gdt}.

{\vspace{0pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
open datos/GNPvsMelanoma.gdt
\end{verbatim}
}
\end{enumerate}

\subsection{Actividad 1 - Dibujar ambas series en un mismo gráfico}
\label{sec:orgd7841f6}
Marque las series \texttt{GNP} y \texttt{Melanoma}. Pulse sobre ellas con el botón
derecho del ratón. En el menú desplegable seleccione \textbf{\emph{\texttt{Gráfico de
Series Temporales}}} (indique representar en un único gráfico).

Guarde el gráfico en la sesión como un icono.

{\vspace{1pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
GraficoSeriesEnNiveles <- gnuplot GNP Melanoma --time-series --with-lines
\end{verbatim}
}

\vspace{-3pt}

\subsection{Actividad 2 - Dibujar el diagrama de dispersión}
\label{sec:org2838ff8}
Marque las series \texttt{GNP} y \texttt{Melanoma}. Pulse sobre ellas con el botón
derecho del ratón. En el menú desplegable seleccione \textbf{\emph{\texttt{Gráfico de
dispersión XY}}} (elija como variable del eje X \texttt{Melanoma} y marque
suprimir la recta estimada).

Guarde el gráfico en la sesión como un icono.

{\vspace{1pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
DiagramDispersion <- gnuplot GNP Melanoma --fit=none
\end{verbatim}
}

\vspace{-3pt}

\begin{enumerate}
\item ¿Tienen tendencia estas series temporales?
\item ¿Parece ser una tendencia común a ambas series?
\item Pero\ldots{} ¿lo podemos saber con seguridad solo mirando el gráfico?
\end{enumerate}

\subsection{Actividad 3 - Calcular la correlación entre ambas series}
\label{sec:org0ed41c3}
Marque las series \texttt{GNP} y \texttt{Melanoma}. Pulse sobre ellas con el botón
derecho del ratón. En el menú desplegable seleccione \textbf{\emph{\texttt{Matriz de
correlación}}}

{\vspace{0pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
corr GNP Melanoma
\end{verbatim}
}
