Practicas/PracticasGretl/Prct-Lecc03.org
** Actividad 4 - Regresar =GNP= sobre =Melanoma= y constatar que el ajuste es bueno
Estime el modelo mediante los menús desplegables: */~Modelo -> Mínimos
  Cuadrados Ordinarios~/*; indique a [[https://gretl.sourceforge.net/es.html][Gretl]] el regresando y regresor y
  pulse */~Aceptar~/*.

#+latex: {\vspace{0pt} \footnotesize \color{gray!70!black}
/o bien teclee en linea de comandos/:
#+begin_src hansl 
AjusteEnNiveles <- ols GNP 0 Melanoma
#+end_src
#+latex: }

Aunque el coeficiente de determinación es muy elevado y los parámetros
muy significativos, el modelo "/no vale una castaña/". Una forma de
constatarlo es darse cuenta de que si fuera cierto que $$
\boldsymbol{y}=\beta_1 \boldsymbol{1} + \beta_2 \boldsymbol{x} +
\boldsymbol{u} $$ Entonces también sería cierto que (y nótese que
$\nabla\boldsymbol{1}=\boldsymbol{0}$) $$ \nabla\boldsymbol{y}=
\beta_2 \nabla\boldsymbol{x} + \nabla\boldsymbol{u}$$

Consecuentemente, si $\boldsymbol{y}$ corresponde al =GNP= y
$\boldsymbol{x}$ a =Melanoma=, al regresar la primera diferencia de
=GNP= sobre la primera diferencia de =Melanoma= el ajuste debería
indicar que el parámetro de la constante ($\beta_1$) no es
significativo, pero si la pendiente ($\beta_2$). Veamos que ocurre justo lo contrario...

** Actividad 5 - Añadir la primera diferencia de los datos

Selecione con el ratón la variable =GNP= y =Melanoma=. Luego pulse en el menú desplegable */~Añadir~/* que aparece arriba, en el centro de la
ventana principal de [[https://gretl.sourceforge.net/es.html][Gretl]].
  + */~Añadir -> Primeras diferencias de las variables seleccionadas~/*

Haga un gráfico con ambas series (verá que la tendencia ha desaparecido y que ya no se parecen entre sí).

Calcule también la correlación entre ambas series diferenciadas
(recuerde que en un modelo lineal simple el cuadrado de dicha
correlación es el coeficiente de determinación).

#+latex: {\vspace{0pt} \footnotesize \color{gray!70!black}
/o bien teclee en linea de comandos/: 
      #+begin_src hansl 
diff GNP Melanoma
GraficoSeriesEnDiferencias <- gnuplot d_GNP d_Melanoma --time-series --with-lines
corr d_GNP d_Melanoma
      #+end_src
      #+latex: }

** Actividad 6 - Regresar =d_GNP= sobre =d_Melanoma= y constatar que el ajuste es horrible

Estime el modelo mediante los menús desplegables: */~Modelo -> Mínimos
  Cuadrados Ordinarios~/*; indique a [[https://gretl.sourceforge.net/es.html][Gretl]] el regresando y regresor y
  pulse */~Aceptar~/*.

#+latex: {\vspace{0pt} \footnotesize \color{gray!70!black}
/o bien teclee en linea de comandos/:
#+begin_src hansl 
AjusteEnDiferencias <- ols d_GNP 0 d_Melanoma
#+end_src
#+latex: }

*Conclusión.* Las variables =GNP= y =Melanoma= muestran una tendencia
creciente, lo que conduce a un elevado coeficiente de correlación
entre ellas; pero la tendencia ni es común, ni la correlación se puede
atribuir a ningúna relación de causalidad entre ellas. La correlación
en este caso es espuria (es decir, carece de sentido tartar de
interpretarla).

# +LATEX: \clearpage
#+latex: \vspace{10pt}
#+latex: \noindent
*Código completo de la práctica* ~GNPvsMelanoma.inp~
#+latex: \vspace{10pt}
\lstinputlisting{scripts/GNPvsMelanoma.inp}
#+LATEX: \clearpage


* Tipos de interés a corto y largo plazo
   :PROPERTIES:
   :header-args: :tangle ./pub/scripts/UKinterestRates.inp
   :END:

   | Guión: | [[https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/UKinterestRates.inp][UKinterestRates.inp]] |
   
***** Objetivo
Ver que probablemmente la correlación entre los tipos a corto y largo
plazo no es espuria, y que ambas series probablemente están
cointegrados.

***** Carga de datos
*/~Archivo --> Abrir datos --> Archivo de usuario~/* y buscar en el
disco el fichero =UKinterestRates.gdt=.

#+latex: {\vspace{0pt} \footnotesize \color{gray!70!black}
/o bien teclee en linea de comandos/:
#+begin_src hansl 
open datos/UKinterestRates.gdt
#+end_src
#+latex: }

** Actividad 1 - Dibujar ambas series en un mismo gráfico
Marque las series =Long= y =Short=. Pulse sobre ellas con el botón
derecho del ratón. En el menú desplegable seleccione */~Gráfico de
Series Temporales~/* (indique representar en un único gráfico).

Guarde el gráfico en la sesión como un icono.

#+latex: {\vspace{1pt} \footnotesize \color{gray!70!black}
/o bien teclee en linea de comandos/:
      #+begin_src hansl
      GraficoSeriesEnNiveles <- gnuplot Long Short --time-series --with-lines
      #+end_src
      #+latex: }
 
#+latex: \vspace{-3pt}   

1) ¿Tienen tendencia estas series temporales?
2) ¿Parece ser una tendencia común a ambas series?
3) Pero... ¿lo podemos saber con seguridad solo mirando el gráfico?

