docs/Practicas/PracticasGretl/Prct-Lecc03.html
<div id="outline-container-org66cbcb4" class="outline-3">
<h3 id="org66cbcb4"><span class="section-number-3">1.4.</span> Actividad 4 - Regresar <code>GNP</code> sobre <code>Melanoma</code> y constatar que el ajuste es bueno</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Estime el modelo mediante los menús desplegables: <b><i><code>Modelo -&gt; Mínimos
  Cuadrados Ordinarios</code></i></b>; indique a <a href="https://gretl.sourceforge.net/es.html">Gretl</a> el regresando y regresor y
  pulse <b><i><code>Aceptar</code></i></b>.
</p>

<p>
<i>o bien teclee en linea de comandos</i>:
</p>
<div class="org-src-container">
<pre class="src src-hansl">AjusteEnNiveles &lt;- ols GNP 0 Melanoma
</pre>
</div>
<p>
Aunque el coeficiente de determinación es muy elevado y los parámetros
muy significativos, el modelo "<i>no es válido</i>". Una forma de
constatarlo es darse cuenta de que si fuera cierto que
</p>

<p>
\[\boldsymbol{y}=\beta_1 \boldsymbol{1} + \beta_2 \boldsymbol{x} +
\boldsymbol{u}\]
</p>

<p>
Entonces también sería cierto que (y nótese que
\(\nabla\boldsymbol{1}=\boldsymbol{0}\))
</p>

<p>
\[\nabla\boldsymbol{y}=\beta_2 \nabla\boldsymbol{x} +
\nabla\boldsymbol{u}\]
</p>

<p>
Consecuentemente, si \(\boldsymbol{y}\) corresponde al <code>GNP</code> y
\(\boldsymbol{x}\) a <code>Melanoma</code>, al regresar la primera diferencia de
<code>GNP</code> sobre la primera diferencia de <code>Melanoma</code> el ajuste debería
indicar que el parámetro de la constante (\(\beta_1\)) no es
significativo, pero si la pendiente (\(\beta_2\)). Veamos que ocurre justo lo contrario&#x2026;
</p>
</div>
</div>
<div id="outline-container-orgd32674e" class="outline-3">
<h3 id="orgd32674e"><span class="section-number-3">1.5.</span> Actividad 5 - Añadir la primera diferencia de los datos</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Seleccione con el ratón la variable <code>GNP</code> y <code>Melanoma</code>. Luego pulse en el menú desplegable <b><i><code>Añadir</code></i></b> que aparece arriba, en el centro de la
ventana principal de <a href="https://gretl.sourceforge.net/es.html">Gretl</a>.
</p>
<ul class="org-ul">
<li><b><i><code>Añadir -&gt; Primeras diferencias de las variables seleccionadas</code></i></b></li>
</ul>

<p>
Haga un gráfico con ambas series (verá que la tendencia ha desaparecido y que ya no se parecen entre sí).
</p>

<p>
Calcule también la correlación entre ambas series diferenciadas
(recuerde que en un modelo lineal simple el cuadrado de dicha
correlación es el coeficiente de determinación).
</p>

<p>
<i>o bien teclee en linea de comandos</i>: 
</p>
<div class="org-src-container">
<pre class="src src-hansl">diff GNP Melanoma
GraficoSeriesEnDiferencias &lt;- gnuplot d_GNP d_Melanoma --time-series --with-lines
corr d_GNP d_Melanoma
</pre>
</div>
</div>
</div>
<div id="outline-container-org4252351" class="outline-3">
<h3 id="org4252351"><span class="section-number-3">1.6.</span> Actividad 6 - Regresar <code>d_GNP</code> sobre <code>d_Melanoma</code> y constatar que el ajuste es horrible</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Estime el modelo mediante los menús desplegables: <b><i><code>Modelo -&gt; Mínimos
  Cuadrados Ordinarios</code></i></b>; indique a <a href="https://gretl.sourceforge.net/es.html">Gretl</a> el regresando y regresor y
  pulse <b><i><code>Aceptar</code></i></b>.
</p>

<p>
<i>o bien teclee en linea de comandos</i>:
</p>
<div class="org-src-container">
<pre class="src src-hansl">AjusteEnDiferencias &lt;- ols d_GNP 0 d_Melanoma
</pre>
</div>
<p>
<b>Conclusión.</b> Las variables <code>GNP</code> y <code>Melanoma</code> muestran una tendencia
creciente, lo que conduce a un elevado coeficiente de correlación
entre ellas; pero la tendencia ni es común, ni la correlación se puede
atribuir a ninguna relación de causalidad entre ellas. La correlación
en este caso es espuria (es decir, carece de sentido tratar de
interpretarla).
</p>

<p>
<b>Código completo de la práctica</b> <code>GNPvsMelanoma.inp</code>
</p>
<p>
\lstinputlisting{scripts/GNPvsMelanoma.inp}
</p>
</div>
</div>
</div>
<div id="outline-container-org451b297" class="outline-2">
<h2 id="org451b297"><span class="section-number-2">2.</span> Tipos de interés a corto y largo plazo</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Guión:</td>
<td class="org-left"><a href="https://github.com/mbujosab/EconometriaAplicada-SRC/blob/main/Practicas/PracticasGretl/pub/scripts/UKinterestRates.inp">UKinterestRates.inp</a></td>
</tr>
</tbody>
</table>
</div>
<ol class="org-ol">
<li><a id="org7e6098f"></a>Objetivo<br />
<div class="outline-text-6" id="text-2-0-0-0-1">
<p>
Ver que probablemente la correlación entre los tipos a corto y largo
plazo no es espuria, y que ambas series probablemente están
cointegrados.
</p>
</div>
</li>
<li><a id="org0bee309"></a>Carga de datos<br />
<div class="outline-text-6" id="text-2-0-0-0-2">
<p>
<b><i><code>Archivo --&gt; Abrir datos --&gt; Archivo de usuario</code></i></b> y buscar en el
disco el fichero <code>UKinterestRates.gdt</code>.
</p>

<p>
<i>o bien teclee en linea de comandos</i>:
</p>
<div class="org-src-container">
<pre class="src src-hansl">open datos/UKinterestRates.gdt
</pre>
</div>
</div>
</li>
</ol>
