Practicas/PracticasGretl/pub/Prct-Lecc03.tex

\subsection{Actividad 4 - Regresar \texttt{GNP} sobre \texttt{Melanoma} y constatar que el ajuste es bueno}
\label{sec:org70554fa}
Estime el modelo mediante los menús desplegables: \textbf{\emph{\texttt{Modelo -> Mínimos
  Cuadrados Ordinarios}}}; indique a \href{https://gretl.sourceforge.net/es.html}{Gretl} el regresando y regresor y
  pulse \textbf{\emph{\texttt{Aceptar}}}.

{\vspace{0pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
AjusteEnNiveles <- ols GNP 0 Melanoma
\end{verbatim}
}

Aunque el coeficiente de determinación es muy elevado y los parámetros
muy significativos, el modelo "\emph{no vale una castaña}". Una forma de
constatarlo es darse cuenta de que si fuera cierto que $$
\boldsymbol{y}=\beta_1 \boldsymbol{1} + \beta_2 \boldsymbol{x} +
\boldsymbol{u} $$ Entonces también sería cierto que (y nótese que
\(\nabla\boldsymbol{1}=\boldsymbol{0}\)) $$ \nabla\boldsymbol{y}=
\beta_2 \nabla\boldsymbol{x} + \nabla\boldsymbol{u}$$

Consecuentemente, si \(\boldsymbol{y}\) corresponde al \texttt{GNP} y
\(\boldsymbol{x}\) a \texttt{Melanoma}, al regresar la primera diferencia de
\texttt{GNP} sobre la primera diferencia de \texttt{Melanoma} el ajuste debería
indicar que el parámetro de la constante (\(\beta_1\)) no es
significativo, pero si la pendiente (\(\beta_2\)). Veamos que ocurre justo lo contrario\ldots{}

\subsection{Actividad 5 - Añadir la primera diferencia de los datos}
\label{sec:org9501b93}

Selecione con el ratón la variable \texttt{GNP} y \texttt{Melanoma}. Luego pulse en el menú desplegable \textbf{\emph{\texttt{Añadir}}} que aparece arriba, en el centro de la
ventana principal de \href{https://gretl.sourceforge.net/es.html}{Gretl}.
\begin{itemize}
\item \textbf{\emph{\texttt{Añadir -> Primeras diferencias de las variables seleccionadas}}}
\end{itemize}

Haga un gráfico con ambas series (verá que la tendencia ha desaparecido y que ya no se parecen entre sí).

Calcule también la correlación entre ambas series diferenciadas
(recuerde que en un modelo lineal simple el cuadrado de dicha
correlación es el coeficiente de determinación).

{\vspace{0pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}: 
\begin{verbatim}
diff GNP Melanoma
GraficoSeriesEnDiferencias <- gnuplot d_GNP d_Melanoma --time-series --with-lines
corr d_GNP d_Melanoma
\end{verbatim}
}

\subsection{Actividad 6 - Regresar \texttt{d\_GNP} sobre \texttt{d\_Melanoma} y constatar que el ajuste es horrible}
\label{sec:org2530cb2}

Estime el modelo mediante los menús desplegables: \textbf{\emph{\texttt{Modelo -> Mínimos
  Cuadrados Ordinarios}}}; indique a \href{https://gretl.sourceforge.net/es.html}{Gretl} el regresando y regresor y
  pulse \textbf{\emph{\texttt{Aceptar}}}.

{\vspace{0pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
AjusteEnDiferencias <- ols d_GNP 0 d_Melanoma
\end{verbatim}
}

\textbf{Conclusión.} Las variables \texttt{GNP} y \texttt{Melanoma} muestran una tendencia
creciente, lo que conduce a un elevado coeficiente de correlación
entre ellas; pero la tendencia ni es común, ni la correlación se puede
atribuir a ningúna relación de causalidad entre ellas. La correlación
en este caso es espuria (es decir, carece de sentido tartar de
interpretarla).

\vspace{10pt}
\noindent
\textbf{Código completo de la práctica} \texttt{GNPvsMelanoma.inp}
\vspace{10pt}
\lstinputlisting{scripts/GNPvsMelanoma.inp}
\clearpage


\section{Tipos de interés a corto y largo plazo}
\label{sec:orge3912a0}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/UKinterestRates.inp}{UKinterestRates.inp}\\[0pt]
\end{tabular}
\end{center}

\begin{enumerate}
\item Objetivo
\label{sec:org6e55aaa}
Ver que probablemmente la correlación entre los tipos a corto y largo
plazo no es espuria, y que ambas series probablemente están
cointegrados.

\item Carga de datos
\label{sec:orgff467b8}
\textbf{\emph{\texttt{Archivo -{}-{}> Abrir datos -{}-{}> Archivo de usuario}}} y buscar en el
disco el fichero \texttt{UKinterestRates.gdt}.

{\vspace{0pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
open datos/UKinterestRates.gdt
\end{verbatim}
}
\end{enumerate}
